//
//  File.swift
//  Menu
//
//  Created by Mac on 6/6/2563 BE.
//  Copyright © 2563 Kittinun Chobtham. All rights reserved.
//

import Foundation
var menuItem : [MenuItem] = [MenuItem(id: 1, name: "ผัดกระเพรากุ้ง", detail: "กุ้งสดๆ หวานๆ ใบกระเพราหอมๆ และเทคนิคการปรุงรสอาหารที่ไม่หวานหรือเค็มเกินๆ", imageName: "ผัดกระเพรากุ้ง", price: 40),MenuItem(id: 2, name: "ข้าวผัดแกงเขียวหวาน", detail: "นำแกงเขียวหวานมาทำแบบน้ำขลุกขลิก และผัดกับข้าว เป็นข้าวผัดรสแกงเขียหวาน", imageName: "ข้าวผัดแกงเขียวหวาน", price: 30),MenuItem(id: 3, name: "แกงเขียวหวานพาสต้า", detail: "เส้นพาสต้าที่เหนียวนุ่ม และแกงเขียวหวานที่ปรุงรสอย่างกลมกล่อม", imageName: "แกงเขียวหวานพาสต้า", price: 30),MenuItem(id: 4, name: "ผัดคะน้าหมูกรอบ", detail: "ผักคะน้าหวาน ไม่ขม หมูกรอบที่หนังกรอบ เนื้อนุ่ม และการปรุงรสที่รสชาติกลมกล่อมพอดี", imageName: "ผัดคะน้าหมูกรอบ", price: 40),MenuItem(id: 5, name: "แกงเขียวหวานทะเล", detail: "พริกแกงเขียวจากสมุนไพร แกงกะทิปรุงรสให้กลมกล่อม กับอาหารทะเล กุ้ง หอย ปู ปลา ปลาหมึก แกงเขียวหวาน", imageName: "แกงเขียวหวานทะเล", price: 50),MenuItem(id: 6, name: "ข้าวผัดปู", detail: "ข้าวสวยเป็นเม็ดๆ เนื้อปูไม่คาว ไข่ไม่ไหม้ หอม รสชาติกลมกล่อม", imageName: "ข้าวผัดปู", price: 40),MenuItem(id: 7, name: "หมูสะเต๊ะเจ", detail: "ใช้โปรตีนเกษตร มำผสม ใส่เครื่องปรุงของหมูสะเต๊ะให้มีสีเหลืองๆของขมิ้น", imageName: "หมูสะเต๊ะเจ", price: 30),MenuItem(id: 8, name: "ผัดกระเพราไก่", detail: "การเลือกเนื้อไก่ที่สดๆ ใบกระเพราหอมๆ พริก และกระเทียมที่สำคัญ การปรุงรสชาติ ต้องมีรสชาติกลมกล่อม ไม่หวานหรือเค็มเกินไป", imageName: "ผัดกระเพราไก่", price: 40),MenuItem(id: 9, name: "ลาบเจ", detail: " เมนูลาบ แต่ปรับแต่งอาหารให้เข้ากับเทศกาลกินเจ เป็นลาบเจโดยโปรตีนเกษตรเป็นวัตถุดิบหลัก", imageName: "ลาบเจ", price: 40),MenuItem(id: 10, name: "ยอดตำลึงชุปแป้งทอด", detail: "ความอร่อยของยอดตำลึงชุบแป้งทอดอยู่ที่เทคนิคการทอด ที่ทำให้แป้งกรอบฟู และน้ำจิ้มรสเด็ด", imageName: "ยอดตำลึงชุปแป้งทอด", price: 30)]

var users: [User] = [User(username: "Kaiser", password: "12345")]

var shoppingCart : ShoppingCart = ShoppingCart()
